# Core tools
brew "zsh"
brew "tmux"
brew "neovim"
brew "git"
brew "gh"
brew "ripgrep"
brew "fzf"

# New tools
brew "starship"
brew "zoxide"
brew "lazygit"
brew "bat"
brew "eza"
brew "fd"
brew "btop"

# Casks
cask "ghostty"
