# Core tools
brew "zsh"
brew "tmux"
brew "neovim"
brew "git"
brew "gh"
brew "ripgrep"
brew "fzf"

# Modern CLI replacements
brew "starship"
brew "zoxide"
brew "lazygit"
brew "bat"
brew "eza"
brew "fd"
brew "btop"

# Utilities
brew "asdf"
brew "coreutils"
brew "entr"
brew "jq"
brew "httpie"
brew "mycli"
brew "pgcli"
brew "azure-cli"
brew "telnet"

# Apps
cask "ghostty"
cask "1password"
cask "arc"
cask "firefox"
cask "google-chrome"
cask "raycast"
cask "slack"
cask "spotify"
cask "stats"
cask "elgato-stream-deck"
cask "hiddenbar"
cask "visual-studio-code"
cask "the-unarchiver"
